In [1]:
#Series

In [2]:
import numpy as np
import pandas as pd
label=['a1','b2','c3']
my_lis=[10,20,30]
n1=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [4]:
pd.Series(my_lis) #if label not given it will take index as label

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(n1,index=labels) # to customize labels use index=

a1    10
b2    20
c3    30
dtype: int64

In [3]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
data={
    "Name":['John', "Anna","Peter", "Linda"],
    'Age':[28,34, 29, 42],
    'City':['New York',"Paris","Berlin", "London"],
    'Salary':[65000, 70000, 62000, 85000]
}
df=pd.DataFrame(data_list)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [3]:
data_list=[
    ['John',28,'New York',65000 ],
    ["Anna",34,"Paris",70000 ],
    ["Peter",29,"Berlin",62000], 
    ["Linda",42,"London",85000]
]
column=["Name","Age","City","Salary"]
row=[1,2,3,4]
df2=pd.DataFrame(data_list,columns=column)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [4]:
df2['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [5]:
df2[['Name','City']] #selecting columns

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [6]:
df2.loc[[0,1]] #selecting rows

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [8]:
df2.iloc[[0,1]][["City","Salary"]]# selecting subset of rows and columns

       City  Salary
0  New York   65000
1     Paris   70000

In [12]:
df2[(df2["Age"]>30) & (df2["City"]=="Paris"]

TypeError: Cannot perform 'rand_' with a dtyped [object] array and scalar of type [bool]